In [2]:
import pandas as pd
import numpy as np

# Creando un data frame

In [4]:
df = pd.read_csv('../data/mastermind-220421-143506.csv', index_col=[0])

In [5]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [19]:
df['especialidad']

0               Hardware
1       Edición de vídeo
2           Programación
3           Programación
4    Sistemas Operativos
5               Robótica
6                Hacking
Name: especialidad, dtype: object

# Construir un dataframe

In [25]:
datos = {
    'nombre': ['SFDX show','Sara Nogark', 'Nate Gentile', 'Bettatech','Antonio Sarosi', 'Edgar Pons', 'Savitar'], 
    'especialidad': list(df['especialidad']),
    'edad': [np.random.randint(28,31) for i in range(7)],
    'visitas': [np.random.randint(10000,15000) for i in range(7)],
}

In [26]:
df_inventado = pd.DataFrame(datos)
df_inventado

           nombre         especialidad  edad
0       SFDX show             Hardware    29
1     Sara Nogark     Edición de vídeo    30
2    Nate Gentile         Programación    28
3       Bettatech         Programación    30
4  Antonio Sarosi  Sistemas Operativos    28
5      Edgar Pons             Robótica    29
6         Savitar              Hacking    29

In [27]:
df_inventado['sexo'] = ['Masculino','Femenino','Femenino','Masculino','Masculino','Masculino','Masculino']

In [28]:
df_inventado

           nombre         especialidad  edad       sexo
0       SFDX show             Hardware    29  Masculino
1     Sara Nogark     Edición de vídeo    30   Femenino
2    Nate Gentile         Programación    28   Femenino
3       Bettatech         Programación    30  Masculino
4  Antonio Sarosi  Sistemas Operativos    28  Masculino
5      Edgar Pons             Robótica    29  Masculino
6         Savitar              Hacking    29  Masculino

# Explorando dataframe

In [29]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

## df.head()

In [31]:
df.head(2)

        nombre      especialidad  edad  visitas sexo
0    SFDX Show          Hardware    30   130855    H
1  Sara Nogark  Edición de vídeo    29   114175    M

## df.tail()

In [32]:
df.tail(2)

       nombre especialidad  edad  visitas sexo
5  Edgar Pons     Robótica    29   143620    H
6     s4vitar      Hacking    28   132567    H

## df.sample()

In [33]:
df.sample()

    nombre especialidad  edad  visitas sexo
6  s4vitar      Hacking    28   132567    H

## df.info()

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   nombre        7 non-null      object
 1   especialidad  7 non-null      object
 2   edad          7 non-null      int64
 3   visitas       7 non-null      int64
 4   sexo          7 non-null      object
dtypes: int64(2), object(3)
memory usage: 336.0+ bytes

## df.describe()

In [36]:
df.describe()

            edad        visitas
count   7.000000       7.000000
mean   29.428571  135033.142857
std     1.272418   11590.990631
min    28.000000  114175.000000
25%    28.500000  131431.500000
50%    29.000000  132567.000000
75%    30.500000  143082.500000
max    31.000000  149462.000000

## df.shape()

In [39]:
df.shape

(7, 5)

## df.columns

In [40]:
df.columns

Index(['nombre', 'especialidad', 'edad', 'visitas', 'sexo'], dtype='object')

## df.index

In [41]:
df.index

Int64Index([0, 1, 2, 3, 4, 5, 6], dtype='int64')

# Selecion de elementos (subset)

## Acceso mediante etiquetas

In [43]:
df.head()

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

In [45]:
df['especialidad'][2]

'Programación'

In [48]:
df['nombre'] == 'Nate Gentile'

0    False
1    False
2     True
3    False
4    False
5    False
6    False
Name: nombre, dtype: bool

In [49]:
df[df['nombre'] == 'Nate Gentile']['especialidad']

2    Programación
Name: especialidad, dtype: object

## df.iloc[]

In [50]:
df.head(5)

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

In [52]:
df.iloc[[2,3],[0,1]]

         nombre  especialidad
2  Nate Gentile  Programación
3     Bettatech  Programación

In [58]:
df.iloc[2,0:2]

nombre          Nate Gentile
especialidad    Programación
Name: 2, dtype: object

## df.loc

In [56]:
df.head()

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

In [55]:
df.loc[2,'especialidad':'visitas']

especialidad    Programación
edad                      31
visitas               142545
Name: 2, dtype: object

# Manipulación de datos

## Cambiar el indice de los datos

### df.set_index()

In [60]:
df.head()

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

In [81]:
df_nuevo = df.set_index('nombre')

In [82]:
df_nuevo

                       especialidad  edad  visitas sexo
nombre
SFDX Show                  Hardware    30   130855    H
Sara Nogark        Edición de vídeo    29   114175    M
Nate Gentile           Programación    31   142545    H
Bettatech              Programación    31   149462    H
Antonio Sarosi  Sistemas Operativos    28   132008    H
Edgar Pons                 Robótica    29   143620    H
s4vitar                     Hacking    28   132567    H

In [74]:
df

                       especialidad  edad  visitas sexo
nombre
SFDX Show                  Hardware    30   130855    H
Sara Nogark        Edición de vídeo    29   114175    M
Nate Gentile           Programación    31   142545    H
Bettatech              Programación    31   149462    H
Antonio Sarosi  Sistemas Operativos    28   132008    H
Edgar Pons                 Robótica    29   143620    H
s4vitar                     Hacking    28   132567    H

In [75]:
df.reset_index(inplace=True)

In [83]:
df_nuevo.head()

                       especialidad  edad  visitas sexo
nombre
SFDX Show                  Hardware    30   130855    H
Sara Nogark        Edición de vídeo    29   114175    M
Nate Gentile           Programación    31   142545    H
Bettatech              Programación    31   149462    H
Antonio Sarosi  Sistemas Operativos    28   132008    H

In [84]:
df_nuevo.loc['Nate Gentile','visitas']

142545

## df.apply()

In [85]:
df.select_dtypes(include='int64')

   edad  visitas
0    30   130855
1    29   114175
2    31   142545
3    31   149462
4    28   132008
5    29   143620
6    28   132567

In [86]:
df.select_dtypes(include='int64').apply(np.sqrt)

       edad     visitas
0  5.477226  361.738856
1  5.385165  337.897914
2  5.567764  377.551321
3  5.567764  386.603156
4  5.291503  363.329052
5  5.385165  378.972295
6  5.291503  364.097514

In [87]:
df['especialidad'].apply(lambda x: x.upper())

0               HARDWARE
1       EDICIÓN DE VÍDEO
2           PROGRAMACIÓN
3           PROGRAMACIÓN
4    SISTEMAS OPERATIVOS
5               ROBÓTICA
6                HACKING
Name: especialidad, dtype: object

In [88]:
 df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [91]:
df['especialidad May'] = df['especialidad'].apply(lambda x: x.upper())

In [92]:
df

,nombre,especialidad,edad,visitas,sexo,especialidad Mas,especialidad May
0,SFDX Show,Hardware,30,130855,H,HARDWARE,HARDWARE
1,Sara Nogark,Edición de vídeo,29,114175,M,EDICIÓN DE VÍDEO,EDICIÓN DE VÍDEO
2,Nate Gentile,Programación,31,142545,H,PROGRAMACIÓN,PROGRAMACIÓN
3,Bettatech,Programación,31,149462,H,PROGRAMACIÓN,PROGRAMACIÓN
4,Antonio Sarosi,Sistemas Operativos,28,132008,H,SISTEMAS OPERATIVOS,SISTEMAS OPERATIVOS
5,Edgar Pons,Robótica,29,143620,H,ROBÓTICA,ROBÓTICA
6,s4vitar,Hacking,28,132567,H,HACKING,HACKING

## df.drop()

In [94]:
df.drop('especialidad Mas', inplace=True, axis=1)

In [95]:
df

,nombre,especialidad,edad,visitas,sexo,especialidad May
0,SFDX Show,Hardware,30,130855,H,HARDWARE
1,Sara Nogark,Edición de vídeo,29,114175,M,EDICIÓN DE VÍDEO
2,Nate Gentile,Programación,31,142545,H,PROGRAMACIÓN
3,Bettatech,Programación,31,149462,H,PROGRAMACIÓN
4,Antonio Sarosi,Sistemas Operativos,28,132008,H,SISTEMAS OPERATIVOS
5,Edgar Pons,Robótica,29,143620,H,ROBÓTICA
6,s4vitar,Hacking,28,132567,H,HACKING

## df.drop_duplicates()

In [97]:
 new_df = df.copy()

In [99]:
new_df.drop_duplicates('edad',keep='last')

       nombre  especialidad  edad  visitas sexo especialidad May
0   SFDX Show      Hardware    30   130855    H         HARDWARE
3   Bettatech  Programación    31   149462    H     PROGRAMACIÓN
5  Edgar Pons      Robótica    29   143620    H         ROBÓTICA
6     s4vitar       Hacking    28   132567    H          HACKING

## df.nlargest()

In [101]:
df.nlargest(3,'visitas')

         nombre  especialidad  edad  visitas sexo especialidad May
3     Bettatech  Programación    31   149462    H     PROGRAMACIÓN
5    Edgar Pons      Robótica    29   143620    H         ROBÓTICA
2  Nate Gentile  Programación    31   142545    H     PROGRAMACIÓN

## df.sort_values()

In [104]:
df.sort_values(by='visitas',ascending=False)

,nombre,especialidad,edad,visitas,sexo,especialidad May
3,Bettatech,Programación,31,149462,H,PROGRAMACIÓN
5,Edgar Pons,Robótica,29,143620,H,ROBÓTICA
2,Nate Gentile,Programación,31,142545,H,PROGRAMACIÓN
6,s4vitar,Hacking,28,132567,H,HACKING
4,Antonio Sarosi,Sistemas Operativos,28,132008,H,SISTEMAS OPERATIVOS
0,SFDX Show,Hardware,30,130855,H,HARDWARE
1,Sara Nogark,Edición de vídeo,29,114175,M,EDICIÓN DE VÍDEO

In [106]:
df.sort_values(by=['edad','visitas'],ascending=False)

,nombre,especialidad,edad,visitas,sexo,especialidad May
3,Bettatech,Programación,31,149462,H,PROGRAMACIÓN
2,Nate Gentile,Programación,31,142545,H,PROGRAMACIÓN
0,SFDX Show,Hardware,30,130855,H,HARDWARE
5,Edgar Pons,Robótica,29,143620,H,ROBÓTICA
1,Sara Nogark,Edición de vídeo,29,114175,M,EDICIÓN DE VÍDEO
6,s4vitar,Hacking,28,132567,H,HACKING
4,Antonio Sarosi,Sistemas Operativos,28,132008,H,SISTEMAS OPERATIVOS

## df.nsmallest()

In [105]:
df.nsmallest(3,'visitas')

,nombre,especialidad,edad,visitas,sexo,especialidad May
1,Sara Nogark,Edición de vídeo,29,114175,M,EDICIÓN DE VÍDEO
0,SFDX Show,Hardware,30,130855,H,HARDWARE
4,Antonio Sarosi,Sistemas Operativos,28,132008,H,SISTEMAS OPERATIVOS

## df.value_counts()

In [111]:
df.value_counts('edad')

edad
28    2
29    2
31    2
30    1
dtype: int64

# Funciones avanzadas

In [114]:
df_nuevo = df.copy()
df_nuevo['nombre'] = ['1','2','3','4','5','6','7']

## pd.concat()

In [118]:
pd.concat([df,df_nuevo]).reset_index(drop=True)

,nombre,especialidad,edad,visitas,sexo,especialidad May
0,SFDX Show,Hardware,30,130855,H,HARDWARE
1,Sara Nogark,Edición de vídeo,29,114175,M,EDICIÓN DE VÍDEO
2,Nate Gentile,Programación,31,142545,H,PROGRAMACIÓN
3,Bettatech,Programación,31,149462,H,PROGRAMACIÓN
4,Antonio Sarosi,Sistemas Operativos,28,132008,H,SISTEMAS OPERATIVOS
5,Edgar Pons,Robótica,29,143620,H,ROBÓTICA
6,s4vitar,Hacking,28,132567,H,HACKING
7,1,Hardware,30,130855,H,HARDWARE
8,2,Edición de vídeo,29,114175,M,EDICIÓN DE VÍDEO
9,3,Programación,31,142545,H,PROGRAMACIÓN
10,4,Programación,31,149462,H,PROGRAMACIÓN
11,5,Sistemas Operativos,28,132008,H,SISTEMAS OPERATIVOS
12,6,Robótica,29,143620,H,ROBÓTICA
13,7,Hacking,28,132567,H,HACKING

## df.where()

In [123]:
filtro1 = df['especialidad'] == 'Programación' 
filtro2 = df['edad'] > 28
#
df.where(filtro1 & filtro2).dropna()

         nombre  especialidad  edad   visitas sexo especialidad May
2  Nate Gentile  Programación  31.0  142545.0    H     PROGRAMACIÓN
3     Bettatech  Programación  31.0  149462.0    H     PROGRAMACIÓN

## df.groupby()

In [124]:
df.head()

,nombre,especialidad,edad,visitas,sexo,especialidad May
0,SFDX Show,Hardware,30,130855,H,HARDWARE
1,Sara Nogark,Edición de vídeo,29,114175,M,EDICIÓN DE VÍDEO
2,Nate Gentile,Programación,31,142545,H,PROGRAMACIÓN
3,Bettatech,Programación,31,149462,H,PROGRAMACIÓN
4,Antonio Sarosi,Sistemas Operativos,28,132008,H,SISTEMAS OPERATIVOS

In [126]:
df.groupby('especialidad').sum()

                     edad  visitas
especialidad
Edición de vídeo       29   114175
Hacking                28   132567
Hardware               30   130855
Programación           62   292007
Robótica               29   143620
Sistemas Operativos    28   132008

# Funciones avanzadas

## pd.pivot_table()

In [11]:
pd.pivot_table(df,index='sexo', columns=['edad'], aggfunc=np.sum)

       visitas
edad        28        29        30        31
sexo
H     264575.0  143620.0  130855.0  292007.0
M          NaN  114175.0       NaN       NaN

# Fechas

## Crear fechas

In [14]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [31]:
fecha = pd.date_range(start='1 january 2021',end='1 July 2021',freq='MS')

In [32]:
'2021/01/01' == fecha[0]

False

In [36]:
df.set_index(pd.DatetimeIndex(fecha))

                    nombre         especialidad  edad  visitas sexo
2021-01-01       SFDX Show             Hardware    30   130855    H
2021-02-01     Sara Nogark     Edición de vídeo    29   114175    M
2021-03-01    Nate Gentile         Programación    31   142545    H
2021-04-01       Bettatech         Programación    31   149462    H
2021-05-01  Antonio Sarosi  Sistemas Operativos    28   132008    H
2021-06-01      Edgar Pons             Robótica    29   143620    H
2021-07-01         s4vitar              Hacking    28   132567    H

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   nombre        7 non-null      object
 1   especialidad  7 non-null      object
 2   edad          7 non-null      int64
 3   visitas       7 non-null      int64
 4   sexo          7 non-null      object
dtypes: int64(2), object(3)
memory usage: 336.0+ bytes